# ScheduleFilter Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleFilter Constructor
ScheduleFilter Class See Also
---
Creates a new ScheduleFilter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ScheduleFilter()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ScheduleFilter()
```

# See Also
ScheduleFilter Class
ScheduleFilter Overload
Autodesk.Revit.DB Namespace